### Introduction To Statistics

Welcome to this study on **Statistics for Data Science!**

This notebook covers:
- Measure of Center
- Measures of spread

In [32]:
import gdown

In [33]:
file_id = '1yB5qSBOLl96Y563nIewKOU8RN_gsY3dO'
gdown.download(f'https://drive.google.com/uc?id={file_id}', 'data.csv', quiet=False)

Downloading...
From: https://drive.google.com/uc?id=1yB5qSBOLl96Y563nIewKOU8RN_gsY3dO
To: c:\Users\personal\Desktop\abeokuta\data_and_data_analysis\week_8\data.csv
100%|██████████| 52.0k/52.0k [00:00<00:00, 700kB/s]

'data.csv'

In [34]:
import pandas as pd
import numpy as np

In [35]:
# Read the downloaded CSV file
df = pd.read_csv('data.csv')
df.head()

   Unnamed: 0    country food_category  consumption  co2_emission
0           1  Argentina          pork        10.51         37.20
1           2  Argentina       poultry        38.66         41.53
2           3  Argentina          beef        55.48       1712.00
3           4  Argentina     lamb_goat         1.56         54.63
4           5  Argentina          fish         4.36          6.96

In [36]:
# dropping the unnamed: 0 column
df.drop('Unnamed: 0', axis = 1, inplace = True)

In [37]:
df

         country food_category  consumption  co2_emission
0      Argentina          pork        10.51         37.20
1      Argentina       poultry        38.66         41.53
2      Argentina          beef        55.48       1712.00
3      Argentina     lamb_goat         1.56         54.63
4      Argentina          fish         4.36          6.96
...          ...           ...          ...           ...
1425  Bangladesh         dairy        21.91         31.21
1426  Bangladesh         wheat        17.47          3.33
1427  Bangladesh          rice       171.73        219.76
1428  Bangladesh      soybeans         0.61          0.27
1429  Bangladesh          nuts         0.72          1.27

[1430 rows x 4 columns]

In [38]:
df.describe(include = 'all')

          country food_category  consumption  co2_emission
count        1430          1430  1430.000000   1430.000000
unique        130            11          NaN           NaN
top     Argentina          pork          NaN           NaN
freq           11           130          NaN           NaN
mean          NaN           NaN    28.110406     74.383993
std           NaN           NaN    49.818044    152.098566
min           NaN           NaN     0.000000      0.000000
25%           NaN           NaN     2.365000      5.210000
50%           NaN           NaN     8.890000     16.530000
75%           NaN           NaN    28.132500     62.597500
max           NaN           NaN   430.760000   1712.000000

In [39]:
be_consumption = df[df['country'] == 'Belgium']

In [40]:
be_consumption

     country food_category  consumption  co2_emission
396  Belgium          pork        38.65        136.80
397  Belgium       poultry        12.20         13.11
398  Belgium          beef        15.63        482.31
399  Belgium     lamb_goat         1.32         46.23
400  Belgium          fish        18.97         30.29
401  Belgium          eggs        12.59         11.57
402  Belgium         dairy       236.19        336.43
403  Belgium         wheat       111.91         21.34
404  Belgium          rice         8.61         11.02
405  Belgium      soybeans         0.07          0.03
406  Belgium          nuts         7.32         12.96

In [41]:
be_consume = be_consumption['consumption']
be_consume

396     38.65
397     12.20
398     15.63
399      1.32
400     18.97
401     12.59
402    236.19
403    111.91
404      8.61
405      0.07
406      7.32
Name: consumption, dtype: float64

In [42]:
# Calculate mean and median consumption in Belgium
print(np.mean(be_consume))

42.13272727272727

In [43]:
print(np.median(be_consume))

12.59

In [44]:
# Filter for USA
usa_consumption = df[df['country'] == 'USA']
usa_consumption

   country food_category  consumption  co2_emission
55     USA          pork        27.64         97.83
56     USA       poultry        50.01         53.72
57     USA          beef        36.24       1118.29
58     USA     lamb_goat         0.43         15.06
59     USA          fish        12.35         19.72
60     USA          eggs        14.58         13.39
61     USA         dairy       254.69        362.78
62     USA         wheat        80.43         15.34
63     USA          rice         6.88          8.80
64     USA      soybeans         0.04          0.02
65     USA          nuts         7.86         13.91

In [45]:
usa_consume = usa_consumption['consumption']
usa_consume

55     27.64
56     50.01
57     36.24
58      0.43
59     12.35
60     14.58
61    254.69
62     80.43
63      6.88
64      0.04
65      7.86
Name: consumption, dtype: float64

In [46]:
# Calculate mean and median consumption in USA
print(np.mean(usa_consume))

44.650000000000006

In [47]:
print(np.median(usa_consume))

14.58

In [48]:
df['country'].value_counts()

country
Argentina       11
Australia       11
Albania         11
Iceland         11
New Zealand     11
                ..
Sierra Leone    11
Sri Lanka       11
Indonesia       11
Liberia         11
Bangladesh      11
Name: count, Length: 130, dtype: int64

In [49]:
# Check the mode of the country column
mode_country = df['country'].mode()

In [50]:
print("Mode Country:", mode_country)

Mode Country: 0        Albania
1        Algeria
2         Angola
3      Argentina
4        Armenia
         ...
125      Uruguay
126    Venezuela
127      Vietnam
128       Zambia
129     Zimbabwe
Name: country, Length: 130, dtype: object

Measure of Spread

In [51]:
df

         country food_category  consumption  co2_emission
0      Argentina          pork        10.51         37.20
1      Argentina       poultry        38.66         41.53
2      Argentina          beef        55.48       1712.00
3      Argentina     lamb_goat         1.56         54.63
4      Argentina          fish         4.36          6.96
...          ...           ...          ...           ...
1425  Bangladesh         dairy        21.91         31.21
1426  Bangladesh         wheat        17.47          3.33
1427  Bangladesh          rice       171.73        219.76
1428  Bangladesh      soybeans         0.61          0.27
1429  Bangladesh          nuts         0.72          1.27

[1430 rows x 4 columns]